###################################################################

# Created by write_sdc on Sun May 14 20:22:04 2017

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -power mW -voltage V       \
-current mA
set_max_area 3.0e+06
set_driving_cell -lib_cell inv_1 [get_ports rst]
set_driving_cell -lib_cell inv_1 [get_ports clk]
set_driving_cell -lib_cell inv_1 [get_ports wr]
set_driving_cell -lib_cell inv_1 [get_ports rd]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[31]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[30]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[29]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[28]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[27]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[26]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[25]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[24]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_wr[0]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[31]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[30]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[29]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[28]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[27]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[26]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[25]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[24]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {addr_req[0]}]
set_driving_cell -lib_cell inv_1 [get_ports busy_mem]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[31]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[30]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[29]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[28]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[27]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[26]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[25]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[24]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[23]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[22]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[21]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[20]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[19]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[18]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[17]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[16]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[15]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[14]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[13]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[12]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[11]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[10]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[9]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[8]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[7]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[6]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[5]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[4]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[3]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[2]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[1]}]
set_driving_cell -lib_cell inv_1 [get_ports {data_rd_mem[0]}]
set_load -pin_load 57.462 [get_ports {data_rd[31]}]
set_load -pin_load 57.462 [get_ports {data_rd[30]}]
set_load -pin_load 57.462 [get_ports {data_rd[29]}]
set_load -pin_load 57.462 [get_ports {data_rd[28]}]
set_load -pin_load 57.462 [get_ports {data_rd[27]}]
set_load -pin_load 57.462 [get_ports {data_rd[26]}]
set_load -pin_load 57.462 [get_ports {data_rd[25]}]
set_load -pin_load 57.462 [get_ports {data_rd[24]}]
set_load -pin_load 57.462 [get_ports {data_rd[23]}]
set_load -pin_load 57.462 [get_ports {data_rd[22]}]
set_load -pin_load 57.462 [get_ports {data_rd[21]}]
set_load -pin_load 57.462 [get_ports {data_rd[20]}]
set_load -pin_load 57.462 [get_ports {data_rd[19]}]
set_load -pin_load 57.462 [get_ports {data_rd[18]}]
set_load -pin_load 57.462 [get_ports {data_rd[17]}]
set_load -pin_load 57.462 [get_ports {data_rd[16]}]
set_load -pin_load 57.462 [get_ports {data_rd[15]}]
set_load -pin_load 57.462 [get_ports {data_rd[14]}]
set_load -pin_load 57.462 [get_ports {data_rd[13]}]
set_load -pin_load 57.462 [get_ports {data_rd[12]}]
set_load -pin_load 57.462 [get_ports {data_rd[11]}]
set_load -pin_load 57.462 [get_ports {data_rd[10]}]
set_load -pin_load 57.462 [get_ports {data_rd[9]}]
set_load -pin_load 57.462 [get_ports {data_rd[8]}]
set_load -pin_load 57.462 [get_ports {data_rd[7]}]
set_load -pin_load 57.462 [get_ports {data_rd[6]}]
set_load -pin_load 57.462 [get_ports {data_rd[5]}]
set_load -pin_load 57.462 [get_ports {data_rd[4]}]
set_load -pin_load 57.462 [get_ports {data_rd[3]}]
set_load -pin_load 57.462 [get_ports {data_rd[2]}]
set_load -pin_load 57.462 [get_ports {data_rd[1]}]
set_load -pin_load 57.462 [get_ports {data_rd[0]}]
set_load -pin_load 57.462 [get_ports {addr_resp[31]}]
set_load -pin_load 57.462 [get_ports {addr_resp[30]}]
set_load -pin_load 57.462 [get_ports {addr_resp[29]}]
set_load -pin_load 57.462 [get_ports {addr_resp[28]}]
set_load -pin_load 57.462 [get_ports {addr_resp[27]}]
set_load -pin_load 57.462 [get_ports {addr_resp[26]}]
set_load -pin_load 57.462 [get_ports {addr_resp[25]}]
set_load -pin_load 57.462 [get_ports {addr_resp[24]}]
set_load -pin_load 57.462 [get_ports {addr_resp[23]}]
set_load -pin_load 57.462 [get_ports {addr_resp[22]}]
set_load -pin_load 57.462 [get_ports {addr_resp[21]}]
set_load -pin_load 57.462 [get_ports {addr_resp[20]}]
set_load -pin_load 57.462 [get_ports {addr_resp[19]}]
set_load -pin_load 57.462 [get_ports {addr_resp[18]}]
set_load -pin_load 57.462 [get_ports {addr_resp[17]}]
set_load -pin_load 57.462 [get_ports {addr_resp[16]}]
set_load -pin_load 57.462 [get_ports {addr_resp[15]}]
set_load -pin_load 57.462 [get_ports {addr_resp[14]}]
set_load -pin_load 57.462 [get_ports {addr_resp[13]}]
set_load -pin_load 57.462 [get_ports {addr_resp[12]}]
set_load -pin_load 57.462 [get_ports {addr_resp[11]}]
set_load -pin_load 57.462 [get_ports {addr_resp[10]}]
set_load -pin_load 57.462 [get_ports {addr_resp[9]}]
set_load -pin_load 57.462 [get_ports {addr_resp[8]}]
set_load -pin_load 57.462 [get_ports {addr_resp[7]}]
set_load -pin_load 57.462 [get_ports {addr_resp[6]}]
set_load -pin_load 57.462 [get_ports {addr_resp[5]}]
set_load -pin_load 57.462 [get_ports {addr_resp[4]}]
set_load -pin_load 57.462 [get_ports {addr_resp[3]}]
set_load -pin_load 57.462 [get_ports {addr_resp[2]}]
set_load -pin_load 57.462 [get_ports {addr_resp[1]}]
set_load -pin_load 57.462 [get_ports {addr_resp[0]}]
set_load -pin_load 57.462 [get_ports rdy]
set_load -pin_load 57.462 [get_ports busy]
set_load -pin_load 57.462 [get_ports wr_mem]
set_load -pin_load 57.462 [get_ports rd_mem]
set_load -pin_load 57.462 [get_ports {data_wr_mem[31]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[30]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[29]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[28]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[27]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[26]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[25]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[24]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[23]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[22]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[21]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[20]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[19]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[18]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[17]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[16]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[15]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[14]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[13]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[12]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[11]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[10]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[9]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[8]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[7]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[6]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[5]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[4]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[3]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[2]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[1]}]
set_load -pin_load 57.462 [get_ports {data_wr_mem[0]}]
set_load -pin_load 57.462 [get_ports {addr_mem[31]}]
set_load -pin_load 57.462 [get_ports {addr_mem[30]}]
set_load -pin_load 57.462 [get_ports {addr_mem[29]}]
set_load -pin_load 57.462 [get_ports {addr_mem[28]}]
set_load -pin_load 57.462 [get_ports {addr_mem[27]}]
set_load -pin_load 57.462 [get_ports {addr_mem[26]}]
set_load -pin_load 57.462 [get_ports {addr_mem[25]}]
set_load -pin_load 57.462 [get_ports {addr_mem[24]}]
set_load -pin_load 57.462 [get_ports {addr_mem[23]}]
set_load -pin_load 57.462 [get_ports {addr_mem[22]}]
set_load -pin_load 57.462 [get_ports {addr_mem[21]}]
set_load -pin_load 57.462 [get_ports {addr_mem[20]}]
set_load -pin_load 57.462 [get_ports {addr_mem[19]}]
set_load -pin_load 57.462 [get_ports {addr_mem[18]}]
set_load -pin_load 57.462 [get_ports {addr_mem[17]}]
set_load -pin_load 57.462 [get_ports {addr_mem[16]}]
set_load -pin_load 57.462 [get_ports {addr_mem[15]}]
set_load -pin_load 57.462 [get_ports {addr_mem[14]}]
set_load -pin_load 57.462 [get_ports {addr_mem[13]}]
set_load -pin_load 57.462 [get_ports {addr_mem[12]}]
set_load -pin_load 57.462 [get_ports {addr_mem[11]}]
set_load -pin_load 57.462 [get_ports {addr_mem[10]}]
set_load -pin_load 57.462 [get_ports {addr_mem[9]}]
set_load -pin_load 57.462 [get_ports {addr_mem[8]}]
set_load -pin_load 57.462 [get_ports {addr_mem[7]}]
set_load -pin_load 57.462 [get_ports {addr_mem[6]}]
set_load -pin_load 57.462 [get_ports {addr_mem[5]}]
set_load -pin_load 57.462 [get_ports {addr_mem[4]}]
set_load -pin_load 57.462 [get_ports {addr_mem[3]}]
set_load -pin_load 57.462 [get_ports {addr_mem[2]}]
set_load -pin_load 57.462 [get_ports {addr_mem[1]}]
set_load -pin_load 57.462 [get_ports {addr_mem[0]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[31]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[30]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[29]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[28]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[27]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[26]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[25]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[24]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[23]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[22]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[21]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[20]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[19]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[18]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[17]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[16]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[15]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[14]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[13]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[12]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[11]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[10]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[9]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[8]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[7]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[6]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[5]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[4]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[3]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[2]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[1]}]
set_load -pin_load 57.462 [get_ports {cache_miss_count[0]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[31]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[30]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[29]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[28]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[27]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[26]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[25]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[24]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[23]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[22]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[21]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[20]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[19]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[18]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[17]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[16]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[15]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[14]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[13]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[12]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[11]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[10]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[9]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[8]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[7]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[6]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[5]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[4]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[3]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[2]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[1]}]
set_load -pin_load 57.462 [get_ports {cache_hit_count[0]}]
create_clock [get_ports clk]  -period 50000  -waveform {0 25000}
set_input_delay -clock clk  4.8  [get_ports clk]
set_input_delay -clock clk  4.8  [get_ports rst]
set_input_delay -clock clk  4.8  [get_ports wr]
set_input_delay -clock clk  4.8  [get_ports rd]
set_input_delay -clock clk  4.8  [get_ports {data_wr[31]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[30]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[29]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[28]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[27]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[26]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[25]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[24]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[23]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[22]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[21]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[20]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[19]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[18]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[17]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[16]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[15]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[14]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[13]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[12]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[11]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[10]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[9]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[8]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[7]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[6]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[5]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[4]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[3]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[2]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[1]}]
set_input_delay -clock clk  4.8  [get_ports {data_wr[0]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[31]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[30]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[29]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[28]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[27]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[26]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[25]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[24]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[23]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[22]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[21]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[20]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[19]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[18]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[17]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[16]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[15]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[14]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[13]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[12]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[11]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[10]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[9]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[8]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[7]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[6]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[5]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[4]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[3]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[2]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[1]}]
set_input_delay -clock clk  4.8  [get_ports {addr_req[0]}]
set_input_delay -clock clk  4.8  [get_ports busy_mem]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[31]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[30]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[29]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[28]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[27]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[26]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[25]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[24]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[23]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[22]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[21]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[20]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[19]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[18]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[17]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[16]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[15]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[14]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[13]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[12]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[11]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[10]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[9]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[8]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[7]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[6]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[5]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[4]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[3]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[2]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[1]}]
set_input_delay -clock clk  4.8  [get_ports {data_rd_mem[0]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[31]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[30]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[29]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[28]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[27]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[26]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[25]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[24]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[23]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[22]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[21]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[20]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[19]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[18]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[17]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[16]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[15]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[14]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[13]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[12]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[11]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[10]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[9]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[8]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[7]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[6]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[5]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[4]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[3]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[2]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[1]}]
set_output_delay -clock clk  4.8  [get_ports {data_rd[0]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[31]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[30]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[29]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[28]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[27]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[26]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[25]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[24]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[23]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[22]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[21]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[20]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[19]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[18]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[17]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[16]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[15]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[14]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[13]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[12]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[11]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[10]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[9]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[8]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[7]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[6]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[5]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[4]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[3]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[2]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[1]}]
set_output_delay -clock clk  4.8  [get_ports {addr_resp[0]}]
set_output_delay -clock clk  4.8  [get_ports rdy]
set_output_delay -clock clk  4.8  [get_ports busy]
set_output_delay -clock clk  4.8  [get_ports wr_mem]
set_output_delay -clock clk  4.8  [get_ports rd_mem]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[31]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[30]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[29]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[28]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[27]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[26]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[25]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[24]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[23]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[22]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[21]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[20]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[19]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[18]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[17]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[16]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[15]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[14]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[13]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[12]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[11]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[10]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[9]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[8]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[7]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[6]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[5]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[4]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[3]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[2]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[1]}]
set_output_delay -clock clk  4.8  [get_ports {data_wr_mem[0]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[31]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[30]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[29]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[28]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[27]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[26]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[25]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[24]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[23]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[22]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[21]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[20]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[19]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[18]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[17]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[16]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[15]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[14]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[13]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[12]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[11]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[10]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[9]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[8]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[7]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[6]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[5]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[4]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[3]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[2]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[1]}]
set_output_delay -clock clk  4.8  [get_ports {addr_mem[0]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[31]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[30]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[29]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[28]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[27]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[26]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[25]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[24]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[23]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[22]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[21]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[20]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[19]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[18]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[17]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[16]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[15]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[14]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[13]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[12]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[11]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[10]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[9]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[8]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[7]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[6]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[5]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[4]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[3]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[2]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[1]}]
set_output_delay -clock clk  4.8  [get_ports {cache_miss_count[0]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[31]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[30]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[29]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[28]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[27]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[26]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[25]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[24]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[23]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[22]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[21]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[20]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[19]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[18]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[17]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[16]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[15]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[14]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[13]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[12]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[11]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[10]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[9]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[8]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[7]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[6]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[5]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[4]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[3]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[2]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[1]}]
set_output_delay -clock clk  4.8  [get_ports {cache_hit_count[0]}]
